package com.cintcm.hamster.relation;

import static org.junit.Assert.*;

import java.util.List;

import org.junit.Test;

import com.cintcm.hamster.relation.io.mysql.MySQLUtils;

public class testCore {

	@Test
	public void test() {

		
		String[] sentences = {"原料炮制杞豆汤参贝陈皮我原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤原料炮制杞豆汤们茵陈汁", "小儿化食丸这是马应龙八宝眼膏"};
		//List<Relation> relations = new ArrayList<Relation>();

		for (String sentence : sentences) {
			List<Relation> rels = new CoreRelationExtractor(sentence,  "中医百科全书")
					.getRelations();
			for (Relation rel: rels){
				System.out.println(rel);
			}
			MySQLUtils.insertPairs("jia3", rels);
		}
	}

}
